BasicCode/4DSystems_Pixxi_Serial_STM32/Pixxi_Serial_4Dlib.cpp
/**
 * Driver for 4D Systems Pixxi based displays.
 *
 * Designed and tested on PixxiLCD 39P4 display over UART at 115200 baud.
 *
 * Current State: Work-In-Progress. This is a direct port of the Pixxi-Serial library provided
 * by 4D Systems, available here:
 * https://github.com/4dsystems/Pixxi-Serial-Arduino-Library/
 *
 * You will also need to download the Pixxi_Const4D.h file from their GitHub which contains
 * all of the colours and commands.
 *
 * TODO: Include license.
 */

#include "stm32l4xx_hal.h"
#include <Pixxi_Serial_4Dlib.h>

Pixxi_Serial_4DLib::Pixxi_Serial_4DLib(UART_HandleTypeDef * port) {
	_huart = port;
	//Flush the buffer
	HAL_UART_AbortReceive(_huart);
}

/**
 * UART Methods
 */

/*
 * Generic method to write a (uint16_t) command to the display.
 */
void Pixxi_Serial_4DLib::WriteInt(uint16_t data) {
	//Separate the upper and lower bytes
	uint8_t thisData[] = {(uint8_t) (data >> 8), (uint8_t) (data & 0xFF)};
    //Write the data
	HAL_UART_Transmit(_huart, thisData, 2, 10);
}

//*********************************************************************************************//
//**********************************Intrinsic 4D Routines**************************************//
//*********************************************************************************************//

void Pixxi_Serial_4DLib::WriteChars(char * charsout)
{
	//Count how many bytes to write
	int numBytes = 0;
	while(*charsout++) {
		numBytes++;
		//Protect against overrun somewhat
		if(numBytes > 1000)
			break;
	}

	HAL_UART_Transmit(_huart, (uint8_t *) charsout, numBytes, 10) ;
}

void Pixxi_Serial_4DLib::WriteBytes(char * source, int size)
{
	HAL_UART_Transmit(_huart, (uint8_t *) source, size, 10);
}

void Pixxi_Serial_4DLib::WriteWords(uint16_t * Source, int Size)
{
  uint16_t wk ;
  for (int i = 0; i < Size; i++)
  {
    wk = *Source++ ;
	//Separate the upper and lower bytes
	uint8_t thisData[] = {(uint8_t) (wk >> 8), (uint8_t) (wk & 0xFF)};
    HAL_UART_Transmit(_huart, (uint8_t *) thisData, 2, 10) ;
  }
}

void Pixxi_Serial_4DLib::getbytes(char * data, int size)
{
	uint8_t readData = 0;

	int response = HAL_UART_Receive(_huart, &readData, size, TimeLimit4D);

	if (response != HAL_OK)
	{
		Error4D = Err4D_Timeout;
		if (Callback4D != NULL)
			Callback4D(Error4D, Error4D_Inv) ;
	}
}

void Pixxi_Serial_4DLib::GetAck(void)
{
	uint8_t readx = 0;
	Error4D = Err4D_OK;

	int response = HAL_UART_Receive(_huart, &readx, 1, TimeLimit4D);

	if (response != HAL_OK)
	{
		//Flush the buffer
		HAL_UART_AbortReceive(_huart);

		Error4D = Err4D_Timeout;
		if (Callback4D != NULL)
			Callback4D(Error4D, Error4D_Inv);
	}
	else if (readx != 6)
	{
		Error4D = Err4D_NAK;
		Error4D_Inv = readx;
		if (Callback4D != NULL)
			Callback4D(Error4D, Error4D_Inv);
	}
}

uint16_t Pixxi_Serial_4DLib::GetWord(void)
{
	uint8_t readx[2] = {0, 0};

	if (Error4D != Err4D_OK)
		return 0 ;

	//Receive 2 bytes
	int response = HAL_UART_Receive(_huart, readx, 2, TimeLimit4D);

	if (response != HAL_OK)
	{
		//Flush the buffer
		HAL_UART_AbortReceive(_huart);

		Error4D  = Err4D_Timeout ;
		if (Callback4D != NULL)
			Callback4D(Error4D, Error4D_Inv) ;
		return 0 ;
	}
	else
		return readx[0] << 8 | readx[1] ;
}

void Pixxi_Serial_4DLib::getString(char * outStr, int strLen)
{
  int readc ;
  unsigned long sttime ;

  if (Error4D != Err4D_OK)
  {
    outStr[0] = 0 ;
    return ;
  }
  readc    = 0 ;
  while ((readc != strLen))
  {
    HAL_UART_Receive(_huart, (uint8_t *)outStr[readc++], 1, TimeLimit4D);
  }

  if (readc != strLen)
  {
    Error4D  = Err4D_Timeout ;
    if (Callback4D != NULL)
      Callback4D(Error4D, Error4D_Inv) ;
  }
  outStr[readc] = 0 ;
}

uint16_t Pixxi_Serial_4DLib::GetAckResp(void)
{
	uint8_t readx[3] = {0, 0, 0};
	Error4D = Err4D_OK;

	int response = HAL_UART_Receive(_huart, readx, 3, TimeLimit4D);

	if (response != HAL_OK)
	{
		//Flush the buffer
		HAL_UART_AbortReceive(_huart);

		Error4D = Err4D_Timeout;
		if (Callback4D != NULL)
			Callback4D(Error4D, Error4D_Inv);
	}
	else if (readx[0] != 6)
	{
		Error4D = Err4D_NAK;
		Error4D_Inv = readx[0];
		if (Callback4D != NULL)
			Callback4D(Error4D, Error4D_Inv);
	}

	return (uint16_t) ((readx[1] << 8) | (readx[2] & 0xFF));
}

uint16_t Pixxi_Serial_4DLib::GetAckRes2Words(uint16_t * word1, uint16_t * word2)
{
	int Result ;
	GetAck() ;
	Result = GetWord() ;
	*word1 = GetWord() ;
	*word2 = GetWord() ;
	return Result ;
}

void Pixxi_Serial_4DLib::GetAck2Words(uint16_t * word1, uint16_t * word2)
{
	GetAck() ;
	*word1 = GetWord() ;
	*word2 = GetWord() ;
}

uint16_t Pixxi_Serial_4DLib::GetAckResSector(t4DSector Sector)
{
	int Result ;
	GetAck() ;
	Result = GetWord() ;
	getbytes(Sector, 512) ;
	return Result ;
}

uint16_t Pixxi_Serial_4DLib::GetAckResStr(char * OutStr)
{
	int Result ;
	GetAck() ;
	Result = GetWord() ;
	getString(OutStr, Result) ;
	return Result ;
}

uint16_t Pixxi_Serial_4DLib::GetAckResData(t4DByteArray OutData, uint16_t size)
{
	int Result ;
	GetAck() ;
	Result = GetWord() ;
	getbytes(OutData, size) ;
	return Result ;
}

void Pixxi_Serial_4DLib::SetThisBaudrate(int Newrate)
{
	//this probably isn't needed on this MCU
}

//*********************************************************************************************//
//**********************************Compound 4D Routines***************************************//
//*********************************************************************************************//

uint16_t Pixxi_Serial_4DLib::bus_In()
{
	HAL_UART_Transmit(_huart, (uint8_t *) (F_bus_In >> 8), 1, 10) ;
	HAL_UART_Transmit(_huart, (uint8_t *) (F_bus_In), 1, 10) ;
	return GetAckResp() ;
}

void Pixxi_Serial_4DLib::bus_Out(uint16_t bits)
{
	WriteInt(F_bus_Out);
	WriteInt(bits);
	GetAck() ;
}

uint16_t Pixxi_Serial_4DLib::bus_Read()
{
	WriteInt(F_bus_Read);
	return GetAckResp() ;
}

void Pixxi_Serial_4DLib::bus_Set(uint16_t IOMap)
{
	HAL_UART_Transmit(_huart, (uint8_t *) (F_bus_Set >> 8), 1, 10) ;
	HAL_UART_Transmit(_huart, (uint8_t *) (F_bus_Set), 1, 10) ;
	HAL_UART_Transmit(_huart, (uint8_t *) (IOMap >> 8), 1, 10) ;
	HAL_UART_Transmit(_huart, (uint8_t *) (IOMap), 1, 10) ;
	GetAck() ;
}

