BasicCode/4DSystems_Pixxi_Serial_STM32/Pixxi_Serial_4Dlib.cpp
void Pixxi_Serial_4DLib::bus_Write(uint16_t bits)
{
	HAL_UART_Transmit(_huart, (uint8_t *) (F_bus_Write >> 8), 1, 10) ;
	HAL_UART_Transmit(_huart, (uint8_t *) (F_bus_Write), 1, 10) ;
	HAL_UART_Transmit(_huart, (uint8_t *) (bits >> 8), 1, 10) ;
	HAL_UART_Transmit(_huart, (uint8_t *) (bits), 1, 10) ;
	GetAck() ;
}

uint16_t Pixxi_Serial_4DLib::charheight(char  testChar)
{
	WriteInt(F_charheight);
	WriteBytes(&testChar, 1);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::charwidth(char  testChar)
{
	WriteInt(F_charwidth);
	WriteBytes(&testChar, 1);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Close(uint16_t  handle)
{
	WriteInt(F_file_Close);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Count(char *  filename)
{
	WriteInt(F_file_Count);
	WriteChars(filename);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Dir(char *  filename)
{
	WriteInt(F_file_Dir);
	WriteChars(filename);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Erase(char *  filename)
{
	WriteInt(F_file_Erase);
	WriteChars(filename);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Error()
{
	WriteInt(F_file_Error);

	return GetAckResp();
}


uint16_t Pixxi_Serial_4DLib::file_Exec(char *  filename, uint16_t  argCount, t4DWordArray  args)
{
	WriteInt(F_file_Exec);
	WriteChars(filename);
	WriteInt(argCount);
	WriteWords(args, argCount);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Exists(char *  filename)
{
	WriteInt(F_file_Exists);
	WriteChars(filename);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_FindFirst(char *  filename)
{
	WriteInt(F_file_FindFirst);
	WriteChars(filename);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_FindNext()
{
	WriteInt(F_file_FindNext);

	return GetAckResp();
}

char Pixxi_Serial_4DLib::file_GetC(uint16_t  handle)
{
	WriteInt(F_file_GetC);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_GetS(char *  stringIn, uint16_t  size, uint16_t  handle)
{
	WriteInt(F_file_GetS);
	WriteInt(size);
	WriteInt(handle);

	return GetAckResStr(stringIn);
}

uint16_t Pixxi_Serial_4DLib::file_GetW(uint16_t  handle)
{
	WriteInt(F_file_GetW);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Image(uint16_t  X, uint16_t  Y, uint16_t  handle)
{
	WriteInt(F_file_Image);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Index(uint16_t  handle, uint16_t  hiSize, uint16_t  loSize, uint16_t  recordNum)
{
	WriteInt(F_file_Index);
	WriteInt(handle);
	WriteInt(hiSize);
	WriteInt(loSize);
	WriteInt(recordNum);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_LoadFunction(char *  filename)
{
	WriteInt(F_file_LoadFunction);
	WriteChars(filename);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_LoadImageControl(char *  datname, char *  GCIName, uint16_t  mode)
{
	WriteInt(F_file_LoadImageControl);
	WriteChars(datname);
	WriteChars(GCIName);
	WriteInt(mode);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_LoadImageControl(uint16_t hiOffset, uint16_t loOffset, uint16_t mode)
{
	WriteInt(F_file_LoadImageControl);
	WriteInt(hiOffset);
	WriteInt(loOffset);
	WriteInt(mode);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_LoadImageControl(int hiOffset, int loOffset, int mode)
{
  return file_LoadImageControl((uint16_t) hiOffset, (uint16_t) loOffset, (uint16_t) mode);
}

uint16_t Pixxi_Serial_4DLib::file_Mount()
{
	WriteInt(F_file_Mount);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Open(char *  filename, char  mode)
{
	WriteInt(F_file_Open);
	WriteChars(filename);
	WriteBytes(&mode, 1);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_PlayWAV(char *  filename)
{
	WriteInt(F_file_PlayWAV);
	WriteChars(filename);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_PutC(char  character, uint16_t  handle)
{
	WriteInt(F_file_PutC);
	WriteInt(character);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_PutS(char *  stringOut, uint16_t  handle)
{
	WriteInt(F_file_PutS);
	WriteChars(stringOut);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_PutW(uint16_t  word, uint16_t  handle)
{
	WriteInt(F_file_PutW);
	WriteInt(word);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Read(t4DByteArray  data, uint16_t  size, uint16_t  handle)
{
	WriteInt(F_file_Read);
	WriteInt(size);
	WriteInt(handle);

	return GetAckResData(data,size);
}

uint16_t Pixxi_Serial_4DLib::file_Rewind(uint16_t  handle)
{
	WriteInt(F_file_Rewind);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Run(char *  filename, uint16_t  argCount, t4DWordArray  args)
{
	WriteInt(F_file_Run);
	WriteChars(filename);
	WriteInt(argCount);
	WriteWords(args, argCount);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_ScreenCapture(uint16_t  X, uint16_t  Y, uint16_t  width, uint16_t  height, uint16_t  handle)
{
	WriteInt(F_file_ScreenCapture);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(width);
	WriteInt(height);
	WriteInt(handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Seek(uint16_t  handle, uint16_t  hiWord, uint16_t  loWord)
{
	WriteInt(F_file_Seek);
	WriteInt(handle);
	WriteInt(hiWord);
	WriteInt(loWord);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::file_Size(uint16_t  handle, uint16_t *  hiWord, uint16_t *  loWord)
{
	WriteInt(F_file_Size);
	WriteInt(handle);

	return GetAckRes2Words(hiWord, loWord);
}

uint16_t Pixxi_Serial_4DLib::file_Tell(uint16_t  handle, uint16_t *  hiWord, uint16_t *  loWord)
{
	WriteInt(F_file_Tell);
	WriteInt(handle);


	return GetAckRes2Words(hiWord, loWord);
}

void Pixxi_Serial_4DLib::file_Unmount()
{
	WriteInt(F_file_Unmount);
	GetAck();
}

uint16_t Pixxi_Serial_4DLib::file_Write(uint16_t  size, t4DByteArray  source, uint16_t  handle)
{
	WriteInt(F_file_Write);
	WriteInt(size);
	WriteBytes(source, size);
	WriteInt(handle);

	return GetAckResp();
}

