BasicCode/4DSystems_Pixxi_Serial_STM32/Pixxi_Serial_4Dlib.cpp
uint16_t Pixxi_Serial_4DLib::gfx_BevelShadow(uint16_t  value)
{
	WriteInt(F_gfx_BevelShadow);
	WriteInt(value);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::gfx_BevelWidth(uint16_t  value)
{
	WriteInt(F_gfx_BevelWidth);
	WriteInt(value);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::gfx_BGcolour(uint16_t  colour)
{
	WriteInt(F_gfx_BGcolour);
	WriteInt(colour);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::gfx_Button(uint16_t  up, uint16_t  x, uint16_t  y, uint16_t  buttonColour, uint16_t  txtColour, uint16_t  font, uint16_t  txtWidth, uint16_t  txtHeight, char *   text)
{
	WriteInt(F_gfx_Button);
	WriteInt(up);
	WriteInt(x);
	WriteInt(y);
	WriteInt(buttonColour);
	WriteInt(txtColour);
	WriteInt(font);
	WriteInt(txtWidth);
	WriteInt(txtHeight);

	WriteChars(text);
	GetAck();
}

void Pixxi_Serial_4DLib::gfx_ChangeColour(uint16_t  oldColour, uint16_t  newColour)
{
	WriteInt(F_gfx_ChangeColour);
	WriteInt(oldColour);
	WriteInt(newColour);
	GetAck();
}

void Pixxi_Serial_4DLib::gfx_Circle(uint16_t  X, uint16_t  Y, uint16_t  radius, uint16_t  colour)
{
	WriteInt(F_gfx_Circle);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(radius);
	WriteInt(colour);
	GetAck();
}

void Pixxi_Serial_4DLib::gfx_CircleFilled(uint16_t  X, uint16_t  Y, uint16_t  radius, uint16_t  colour)
{
	WriteInt(F_gfx_CircleFilled);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(radius);
	WriteInt(colour);
	GetAck();
}

void Pixxi_Serial_4DLib::gfx_Clipping(uint16_t  onOff)
{
	WriteInt(F_gfx_Clipping);
	WriteInt(onOff);
	GetAck();
}

void Pixxi_Serial_4DLib::gfx_ClipWindow(uint16_t  X1, uint16_t  Y1, uint16_t  X2, uint16_t  Y2)
{
	WriteInt(F_gfx_ClipWindow);
	WriteInt(X1);
	WriteInt(Y1);
	WriteInt(X2);
	WriteInt(Y2);
	GetAck();
}

void Pixxi_Serial_4DLib::gfx_Cls()
{
	WriteInt(F_gfx_Cls);
	GetAck();
}

uint16_t Pixxi_Serial_4DLib::gfx_Contrast(uint16_t  Contrast)
{
	WriteInt(F_gfx_Contrast);
	WriteInt(Contrast);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::gfx_Ellipse(uint16_t  X, uint16_t  Y, uint16_t  Xrad, uint16_t  Yrad, uint16_t  colour)
{
	WriteInt(F_gfx_Ellipse);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(Xrad);
	WriteInt(Yrad);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_EllipseFilled(uint16_t  X, uint16_t  Y, uint16_t  Xrad, uint16_t  Yrad, uint16_t  colour)
{
	WriteInt(F_gfx_EllipseFilled);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(Xrad);
	WriteInt(Yrad);
	WriteInt(colour);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::gfx_FrameDelay(uint16_t  Msec)
{
	WriteInt(F_gfx_FrameDelay);
	WriteInt(Msec);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::gfx_Get(uint16_t  Mode)
{
	WriteInt(F_gfx_Get);
	WriteInt(Mode);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::gfx_GetPixel(uint16_t  X, uint16_t  Y)
{
	WriteInt(F_gfx_GetPixel);
	WriteInt(X);
	WriteInt(Y);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::gfx_Line(uint16_t  X1, uint16_t  Y1, uint16_t  X2, uint16_t  Y2, uint16_t  colour)
{
	WriteInt(F_gfx_Line);
	WriteInt(X1);
	WriteInt(Y1);
	WriteInt(X2);
	WriteInt(Y2);
	WriteInt(colour);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::gfx_LinePattern(uint16_t  Pattern)
{
	WriteInt(F_gfx_LinePattern);
	WriteInt(Pattern);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::gfx_LineTo(uint16_t  X, uint16_t  Y)
{
	WriteInt(F_gfx_LineTo);
	WriteInt(X);
	WriteInt(Y);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_MoveTo(uint16_t  X, uint16_t  Y)
{
	WriteInt(F_gfx_MoveTo);
	WriteInt(X);
	WriteInt(Y);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::gfx_Orbit(uint16_t  Angle, uint16_t  Distance, uint16_t *  Xdest, uint16_t *  Ydest)
{
	WriteInt(F_gfx_Orbit);
	WriteInt(Angle);
	WriteInt(Distance);
	GetAck2Words(Xdest,Ydest);

	return 0 ;
}

uint16_t Pixxi_Serial_4DLib::gfx_OutlineColour(uint16_t  colour)
{
	WriteInt(F_gfx_OutlineColour);
	WriteInt(colour);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::gfx_Panel(uint16_t  Raised, uint16_t  X, uint16_t  Y, uint16_t  Width, uint16_t  Height, uint16_t  colour)
{
	WriteInt(F_gfx_Panel);
	WriteInt(Raised);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(Width);
	WriteInt(Height);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_Polygon(uint16_t  n, t4DWordArray  Xvalues, t4DWordArray  Yvalues, uint16_t  colour)
{
	WriteInt(F_gfx_Polygon);
	WriteInt(n);
	WriteWords(Xvalues, n);
	WriteWords(Yvalues, n);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_PolygonFilled(uint16_t  n, t4DWordArray  Xvalues, t4DWordArray  Yvalues, uint16_t  colour)
{
	WriteInt(F_gfx_PolygonFilled);
	WriteInt(n);
	WriteWords(Xvalues, n);
	WriteWords(Yvalues, n);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_Polyline(uint16_t  n, t4DWordArray  Xvalues, t4DWordArray  Yvalues, uint16_t  colour)
{
	WriteInt(F_gfx_Polyline);
	WriteInt(n);
	WriteWords(Xvalues, n);
	WriteWords(Yvalues, n);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_PutPixel(uint16_t  X, uint16_t  Y, uint16_t  colour)
{
	WriteInt(F_gfx_PutPixel);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_Rectangle(uint16_t  X1, uint16_t  Y1, uint16_t  X2, uint16_t  Y2, uint16_t  colour)
{
	WriteInt(F_gfx_Rectangle);
	WriteInt(X1);
	WriteInt(Y1);
	WriteInt(X2);
	WriteInt(Y2);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_RectangleFilled(uint16_t  X1, uint16_t  Y1, uint16_t  X2, uint16_t  Y2, uint16_t  colour)
{
	WriteInt(F_gfx_RectangleFilled);
	WriteInt(X1);
	WriteInt(Y1);
	WriteInt(X2);
	WriteInt(Y2);
	WriteInt(colour);

	GetAck();
}
void Pixxi_Serial_4DLib::gfx_ScreenCopyPaste(uint16_t  Xs, uint16_t  Ys, uint16_t  Xd, uint16_t  Yd, uint16_t  width, uint16_t  height)
{
	WriteInt(F_gfx_ScreenCopyPaste);
	WriteInt(Xs);
	WriteInt(Ys);
	WriteInt(Xd);
	WriteInt(Yd);
	WriteInt(width);
	WriteInt(height);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::gfx_ScreenMode(uint16_t  screenMode)
{
	WriteInt(F_gfx_ScreenMode);
	WriteInt(screenMode);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::gfx_Set(uint16_t  Func, uint16_t  Value)
{
	WriteInt(F_gfx_Set);
	WriteInt(Func);
	WriteInt(Value);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_SetClipRegion()
{
	WriteInt(F_gfx_SetClipRegion);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::gfx_Slider(uint16_t  Mode, uint16_t  X1, uint16_t  Y1, uint16_t  X2, uint16_t  Y2, uint16_t  colour, uint16_t  Scale, uint16_t  Value)
{
	WriteInt(F_gfx_Slider);
	WriteInt(Mode);
	WriteInt(X1);
	WriteInt(Y1);
	WriteInt(X2);
	WriteInt(Y2);
	WriteInt(colour);
	WriteInt(Scale);
	WriteInt(Value);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::gfx_Transparency(uint16_t  OnOff)
{
	WriteInt(F_gfx_Transparency);
	WriteInt(OnOff);

	return GetAckResp();
}

