BasicCode/4DSystems_Pixxi_Serial_STM32/Pixxi_Serial_4Dlib.cpp
uint16_t Pixxi_Serial_4DLib::gfx_TransparentColour(uint16_t  colour)
{
	WriteInt(F_gfx_TransparentColour);
	WriteInt(colour);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::gfx_Triangle(uint16_t  X1, uint16_t  Y1, uint16_t  X2, uint16_t  Y2, uint16_t  X3, uint16_t  Y3, uint16_t  colour)
{
	WriteInt(F_gfx_Triangle);
	WriteInt(X1);
	WriteInt(Y1);
	WriteInt(X2);
	WriteInt(Y2);
	WriteInt(X3);
	WriteInt(Y3);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_TriangleFilled(uint16_t  X1, uint16_t  Y1, uint16_t  X2, uint16_t  Y2, uint16_t  X3, uint16_t  Y3, uint16_t  colour)
{
	WriteInt(F_gfx_TriangleFilled);
	WriteInt(X1);
	WriteInt(Y1);
	WriteInt(X2);
	WriteInt(Y2);
	WriteInt(X3);
	WriteInt(Y3);
	WriteInt(colour);

	GetAck();
}

void Pixxi_Serial_4DLib::gfx_Button4(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_Button4);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_Switch(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_Switch);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_Slider5(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_Slider5);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_Dial(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_Dial);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_Led(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_Led);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_Gauge(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_Gauge);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_AngularMeter(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_AngularMeter);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_LedDigit(uint16_t x, uint16_t y, uint16_t digitSize, uint16_t onColour, uint16_t offColour, uint16_t value)
{
    WriteInt(F_gfx_LedDigit);
    WriteInt(x);
    WriteInt(y);
    WriteInt(digitSize);
    WriteInt(onColour);
    WriteInt(offColour);
    WriteInt(value);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_LedDigits(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_LedDigits);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

void Pixxi_Serial_4DLib::gfx_RulerGauge(uint16_t value, uint16_t hndl, uint16_t params)
{
    WriteInt(F_gfx_RulerGauge);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);

    GetAck();
}

uint16_t Pixxi_Serial_4DLib::img_ClearAttributes(uint16_t  Handle, uint16_t  Index, uint16_t  Value)
{
	WriteInt(F_img_ClearAttributes);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Value);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_Darken(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_img_Darken);
	WriteInt(Handle);
	WriteInt(Index);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_Disable(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_img_Disable);
	WriteInt(Handle);
	WriteInt(Index);

return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_Enable(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_img_Enable);
	WriteInt(Handle);
	WriteInt(Index);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_GetWord(uint16_t  Handle, uint16_t  Index, uint16_t  Offset )
{
	WriteInt(F_img_GetWord);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Offset );

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_Lighten(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_img_Lighten);
	WriteInt(Handle);
	WriteInt(Index);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_SetAttributes(uint16_t  Handle, uint16_t  Index, uint16_t  Value)
{
	WriteInt(F_img_SetAttributes);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Value);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_SetPosition(uint16_t  Handle, uint16_t  Index, uint16_t  Xpos, uint16_t  Ypos)
{
	WriteInt(F_img_SetPosition);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Xpos);
	WriteInt(Ypos);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_SetWord(uint16_t  Handle, uint16_t  Index, uint16_t  Offset , uint16_t  Word)
{
	WriteInt(F_img_SetWord);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Offset);
	WriteInt(Word);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_Show(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_img_Show);
	WriteInt(Handle);
	WriteInt(Index);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::img_Touched(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_img_Touched);
	WriteInt(Handle);
	WriteInt(Index);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::img_FunctionCall(uint16_t imgHndl, uint16_t index, uint16_t value, uint16_t hndl, uint16_t params, uint16_t argCount, uint16_t strMap)
{
    WriteInt(F_img_FunctionCall);
    WriteInt(imgHndl);
    WriteInt(index);
    WriteInt(value);
    WriteInt(hndl);
    WriteInt(params);
    WriteInt(argCount);
    WriteInt(strMap);

    GetAck();
}

uint16_t Pixxi_Serial_4DLib::media_Flush()
{
	WriteInt(F_media_Flush);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::media_Image(uint16_t  X, uint16_t  Y)
{
	WriteInt(F_media_Image);
	WriteInt(X);
	WriteInt(Y);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::media_Init()
{
	WriteInt(F_media_Init);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::media_RdSector(t4DSector  SectorIn)
{
	WriteInt(F_media_RdSector);

	return GetAckResSector(SectorIn);
}

uint16_t Pixxi_Serial_4DLib::media_ReadByte()
{
	WriteInt(F_media_ReadByte);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::media_ReadWord()
{
	WriteInt(F_media_ReadWord);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::media_SetAdd(uint16_t  HiWord, uint16_t  LoWord)
{
	WriteInt(F_media_SetAdd);
	WriteInt(HiWord);
	WriteInt(LoWord);

	GetAck();
}

void Pixxi_Serial_4DLib::media_SetSector(uint16_t  HiWord, uint16_t  LoWord)
{
	WriteInt(F_media_SetSector);
	WriteInt(HiWord);
	WriteInt(LoWord);

	GetAck();
}

void Pixxi_Serial_4DLib::media_Video(uint16_t  X, uint16_t  Y)
{
	WriteInt(F_media_Video);
	WriteInt(X);
	WriteInt(Y);

	GetAck();
}

void Pixxi_Serial_4DLib::media_VideoFrame(uint16_t  X, uint16_t  Y, uint16_t  Framenumber)
{
	WriteInt(F_media_VideoFrame);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(Framenumber);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::media_WriteByte(uint16_t  Byte)
{
	WriteInt(F_media_WriteByte);
	WriteInt(Byte);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::media_WriteWord(uint16_t  Word)
{
	WriteInt(F_media_WriteWord);
	WriteInt(Word);

	return GetAckResp();
}

