BasicCode/4DSystems_Pixxi_Serial_STM32/Pixxi_Serial_4Dlib.cpp
uint16_t Pixxi_Serial_4DLib::media_WrSector(t4DSector  SectorOut)
{
	WriteInt(F_media_WrSector);
	WriteBytes(SectorOut, 512);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::mem_Alloc(uint16_t size)
{
	WriteInt(F_mem_Alloc);
	WriteInt(size);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::mem_Free(uint16_t  Handle)
{
	WriteInt(F_mem_Free);
	WriteInt(Handle);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::mem_Heap()
{
	WriteInt(F_mem_Heap);
	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::pin_HI(uint16_t Pin)
{
	WriteInt(F_pin_HI);
	WriteInt(Pin);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::peekM(uint16_t  Address)
{
	WriteInt(F_peekM);
	WriteInt(Address);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::pin_LO(uint16_t Pin)
{
	WriteInt(F_pin_LO);
	WriteInt(Pin);

	return GetAckResp() ;
}

uint16_t Pixxi_Serial_4DLib::pin_Read(uint16_t Pin)
{
	WriteInt(F_pin_Read);
	WriteInt(Pin);

	return GetAckResp() ;
}

uint16_t Pixxi_Serial_4DLib::pin_Set(uint16_t Mode, uint16_t Pin)
{
	WriteInt(F_pin_Set);
	WriteInt(Mode);
	WriteInt(Pin);

	return GetAckResp() ;
}

void Pixxi_Serial_4DLib::putCH(uint16_t  WordChar)
{
	WriteInt(F_putCH);
	WriteInt(WordChar);

	GetAck() ;
}

void Pixxi_Serial_4DLib::pokeM(uint16_t  Address, uint16_t  WordValue)
{
	WriteInt(F_pokeM);
	WriteInt(Address);
	WriteInt(WordValue);

	GetAck() ;
}

uint16_t Pixxi_Serial_4DLib::putstr(char *  InString)
{
	WriteInt(F_putstr);
	WriteChars(InString);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::print(const char str[])
{
  int len = strlen(str);
  for(int x = 0; x<len; x++)
  {
	putCH(str[x]);
  }
}

void Pixxi_Serial_4DLib::println(const char c[])
{
  print(c);
  putCH('\n');
  putCH('\r');
}

//-Private:

void Pixxi_Serial_4DLib::printNumber(unsigned long n, uint8_t base) {
  char buf[8 * sizeof(long) + 1]; // Assumes 8-bit chars plus zero byte.
  int count = 0;
  do {
    unsigned long m = n;
    n /= base;
    char c = m - base * n;
    buf[count] = c < 10 ? c + '0' : c + 'A' - 10;
    count++;
  } while(n);

  for(int x = count - 1; x>=0; x--)
  {
	putCH(buf[x]);
  }
}

//--------------------------------------------------------

void Pixxi_Serial_4DLib::snd_BufSize(uint16_t  Bufsize)
{
	WriteInt(F_snd_BufSize);
	WriteInt(Bufsize);

	GetAck();
}

void Pixxi_Serial_4DLib::snd_Continue()
{
	WriteInt(F_snd_Continue);

	GetAck();
}

void Pixxi_Serial_4DLib::snd_Pause()
{
	WriteInt(F_snd_Pause);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::snd_Pitch(uint16_t  Pitch)
{
	WriteInt(F_snd_Pitch);
	WriteInt(Pitch);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::snd_Playing()
{
	WriteInt(F_snd_Playing);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::snd_Stop()
{
	WriteInt(F_snd_Stop);

	GetAck();
}

void Pixxi_Serial_4DLib::snd_Volume(uint16_t  Volume)
{
	WriteInt(F_snd_Volume);
	WriteInt(Volume);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::sys_Sleep(uint16_t  Units)
{
	WriteInt(F_sys_Sleep);
	WriteInt(Units);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::touch_DetectRegion(uint16_t  X1, uint16_t  Y1, uint16_t  X2, uint16_t  Y2)
{
	WriteInt(F_touch_DetectRegion);
	WriteInt(X1);
	WriteInt(Y1);
	WriteInt(X2);
	WriteInt(Y2);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::touch_Get(uint16_t  Mode)
{
	WriteInt(F_touch_Get);
	WriteInt(Mode);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::touch_Set(uint16_t  Mode)
{
	WriteInt(F_touch_Set);
	WriteInt(Mode);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::txt_Attributes(uint16_t  Attribs)
{
	WriteInt(F_txt_Attributes);
	WriteInt(Attribs);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_BGcolour(uint16_t  colour)
{
	WriteInt(F_txt_BGcolour);
	WriteInt(colour);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_Bold(uint16_t  Bold)
{
	WriteInt(F_txt_Bold);
	WriteInt(Bold);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_FGcolour(uint16_t  colour)
{
	WriteInt(F_txt_FGcolour);
	WriteInt(colour);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_FontID(uint16_t  FontNumber)
{
	WriteInt(F_txt_FontID);
	WriteInt(FontNumber);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_Height(uint16_t  Multiplier)
{
	WriteInt(F_txt_Height);
	WriteInt(Multiplier);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_Inverse(uint16_t  Inverse)
{
	WriteInt(F_txt_Inverse);
	WriteInt(Inverse);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_Italic(uint16_t  Italic)
{
	WriteInt(F_txt_Italic);
	WriteInt(Italic);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::txt_MoveCursor(uint16_t  Line, uint16_t  Column)
{
	WriteInt(F_txt_MoveCursor);
	WriteInt(Line);
	WriteInt(Column);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::txt_Opacity(uint16_t  TransparentOpaque)
{
	WriteInt(F_txt_Opacity);
	WriteInt(TransparentOpaque);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::txt_Set(uint16_t  Func, uint16_t  Value)
{
	WriteInt(F_txt_Set);
	WriteInt(Func);
	WriteInt(Value);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::txt_Underline(uint16_t  Underline)
{
	WriteInt(F_txt_Underline);
	WriteInt(Underline);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_Width(uint16_t  Multiplier)
{
	WriteInt(F_txt_Width);
	WriteInt(Multiplier);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_Wrap(uint16_t  Position)
{
	WriteInt(F_txt_Wrap);
	WriteInt(Position);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::txt_Xgap(uint16_t  Pixels)
{
	WriteInt(F_txt_Xgap);
	WriteInt(Pixels);

	return GetAckResp() ;
}

uint16_t Pixxi_Serial_4DLib::txt_Ygap(uint16_t  Pixels)
{
	WriteInt(F_txt_Ygap);
	WriteInt(Pixels);

	return GetAckResp() ;
}

uint16_t Pixxi_Serial_4DLib::file_CallFunction(uint16_t  Handle, uint16_t  ArgCount, t4DWordArray  Args)
{
	WriteInt(F_file_CallFunction);
	WriteInt(Handle);
	WriteInt(ArgCount);
	WriteWords(Args, ArgCount);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::sys_GetModel(char *  ModelStr)
{
	WriteInt(F_sys_GetModel);

	return GetAckResStr(ModelStr);
}

uint16_t Pixxi_Serial_4DLib::sys_GetVersion()
{
	WriteInt(F_sys_GetVersion);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::sys_GetPmmC()
{
	WriteInt(F_sys_GetPmmC);

	return GetAckResp();
}

