BasicCode/4DSystems_Pixxi_Serial_STM32/Pixxi_Serial_4Dlib.cpp
uint16_t Pixxi_Serial_4DLib::writeString(uint16_t  Handle, char *  StringOut)
{
	WriteInt(F_writeString);
	WriteInt(Handle);
	WriteChars(StringOut);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::readString(uint16_t  Handle, char *  StringIn)
{
	WriteInt(F_readString);
	WriteInt(Handle);

	return GetAckResStr(StringIn);
}

void Pixxi_Serial_4DLib::blitComtoDisplay(uint16_t  X, uint16_t  Y, uint16_t  Width, uint16_t  Height, t4DByteArray  Pixels)
{
	WriteInt(F_blitComtoDisplay);
	WriteInt(X);
	WriteInt(Y);
	WriteInt(Width);
	WriteInt(Height);
	WriteBytes(Pixels, Width*Height*2);

	GetAck();
	}

uint16_t Pixxi_Serial_4DLib::file_FindFirstRet(char *  Filename, char *  StringIn)
{
	WriteInt(F_file_FindFirstRet);
	WriteChars(Filename);

	return GetAckResStr(StringIn);
}

uint16_t Pixxi_Serial_4DLib::file_FindNextRet(char *  StringIn)
{
	WriteInt(F_file_FindNextRet);

	return GetAckResStr(StringIn);
}

void Pixxi_Serial_4DLib::setbaudWait(uint16_t  Newrate)
{
	WriteInt(F_setbaudWait);
	WriteInt(Newrate);
	SetThisBaudrate(Newrate); // change this systems baud rate to match new display rate, ACK is 100ms away

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::widget_Create(uint16_t count)
{
	WriteInt(F_widget_Create);
	WriteInt(count);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::widget_Add(uint16_t hndl, uint16_t index, uint16_t widget)
{
	WriteInt(F_widget_Add);
	WriteInt(hndl);
	WriteInt(index);
	WriteInt(widget);

	GetAck() ;
}

void Pixxi_Serial_4DLib::widget_Delete(uint16_t hndl, uint16_t index)
{
	WriteInt(F_widget_Delete);
	WriteInt(hndl);
	WriteInt(index);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::widget_Realloc(uint16_t hndl, uint16_t count)
{
	WriteInt(F_widget_Realloc);
	WriteInt(hndl);
	WriteInt(count);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::widget_SetWord(uint16_t Handle, uint16_t  Index, uint16_t  Offset , uint16_t  Word)
{
	WriteInt(F_widget_SetWord);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Offset);
	WriteInt(Word);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::widget_GetWord(uint16_t  Handle, uint16_t  Index, uint16_t  Offset )
{
	WriteInt(F_widget_GetWord);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Offset);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::widget_SetPosition(uint16_t  Handle, uint16_t  Index, uint16_t  Xpos, uint16_t  Ypos)
{
	WriteInt(F_widget_SetPosition);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Xpos);
	WriteInt(Ypos);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::widget_Enable(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_widget_Enable);
	WriteInt(Handle);
	WriteInt(Index);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::widget_Disable(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_widget_Disable);
	WriteInt(Handle);
	WriteInt(Index);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::widget_SetAttributes(uint16_t  Handle, uint16_t  Index, uint16_t  Value)
{
	WriteInt(F_widget_SetAttributes);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Value);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::widget_ClearAttributes(uint16_t  Handle, uint16_t  Index, uint16_t  Value)
{
	WriteInt(F_widget_ClearAttributes);
	WriteInt(Handle);
	WriteInt(Index);
	WriteInt(Value);

	return GetAckResp();
}

uint16_t Pixxi_Serial_4DLib::widget_Touched(uint16_t  Handle, uint16_t  Index)
{
	WriteInt(F_widget_Touched);
	WriteInt(Handle);
	WriteInt(Index);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::widget_InitGradRAM(uint16_t hndl)
{
	WriteInt(F_widget_InitGradRAM);
	WriteInt(hndl);

	GetAck();
}

uint16_t Pixxi_Serial_4DLib::widget_InitString(char * str)
{
	uint16_t len = strlen(str);
	uint16_t addr = mem_Alloc(len);
	SendByteArrayToRAM(addr, len, str);

	return addr;
}

uint16_t Pixxi_Serial_4DLib::widget_InitStringPtr(char * str)
{
	return str_Ptr(widget_InitString(str));
}

uint16_t Pixxi_Serial_4DLib::widget_InitStringArray(char * str, uint16_t len)
{
	uint16_t addr = mem_Alloc(len);
	SendByteArrayToRAM(addr, len, str);
	addr = str_Ptr(addr);

	return addr;
}

void Pixxi_Serial_4DLib::widget_Init(uint16_t len, uint16_t * data, uint16_t * hndl, uint16_t * param)
{
	*param = mem_Alloc(len << 1);
	SendWordArrayToRAM(*param, len, data);
	*hndl = mem_Alloc(24);
}

uint16_t Pixxi_Serial_4DLib::str_Ptr(uint16_t buffer)
{
	WriteInt(F_str_Ptr);
	WriteInt(buffer);

	return GetAckResp();
}

void Pixxi_Serial_4DLib::SendWordArrayToRAM(uint16_t  hndl, uint16_t  length, uint16_t * data)
{
	WriteInt(F_sendWordArrayToRAM);
	WriteInt(hndl);
	WriteInt(length);
	WriteWords(data, length);

	GetAck();
}

void Pixxi_Serial_4DLib::SendByteArrayToRAM(uint16_t  hndl, uint16_t  length, char * data)
{
	WriteInt(F_sendByteArrayToRAM);
	WriteInt(hndl);
	WriteInt(length);
	WriteBytes(data, length);

	GetAck() ;
}
